Revit 2024 API
ParameterTypeId.ViewPhaseFilter Property
 "Phase Filter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ViewPhaseFilter { get; }
Visual Basic
Public Shared ReadOnly Property ViewPhaseFilter As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ViewPhaseFilter {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace